In [1]:
import pandas as pd

In [2]:
# read text file
df = pd.read_fwf('/Users/crisa/Downloads/players_list_foa.txt')
# preview text file
print(df)

         ID Number                  Name  Fed Sex  Tit WTit OTit  FOA   SRtng  \
0         94779929                   NaN  ESP   M  NaN  NaN  NaN  NaN     NaN
1         19605692                   NaN  MTN   M  NaN  NaN  NaN  NaN     NaN
2         19605790                   NaN  MTN   M  NaN  NaN  NaN  NaN     NaN
3         10688862  A Abdel Maabod, Hoda  EGY   F  NaN  NaN  NaN  NaN     NaN
4         33496722                A Aman  IND   M  NaN  NaN  NaN  NaN     NaN
...            ...                   ...  ...  ..  ...  ...  ...  ...     ...
1222452   21052492           Zyzik, Adam  POL   M  NaN  NaN  NaN  NaN     NaN
1222453   21045437    Zyzniewski, Tomasz  POL   M  NaN  NaN  NaN  NaN     NaN
1222454   21857814   Zyznowska, Marianna  POL   F  NaN  NaN  NaN  NaN  1150.0
1222455   41854446          Zyzyk, Piotr  POL   M  NaN  NaN  NaN  NaN     NaN
1222456   10019243          Zziwa Ismail  UGA   M  NaN  NaN  NaN  NaN     NaN

         SGm    SK   RRtng  RGm    Rk  BRtng  BGm  BK  B-day Flag
0        NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN      0  NaN
1        NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN      0  NaN
2        NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN      0  NaN
3        NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   2009    w
4        NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   1996  NaN
...      ...   ...     ...  ...   ...    ...  ...  ..    ...  ...
1222452  NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   2010  NaN
1222453  NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   1988  NaN
1222454  0.0  40.0  1072.0  0.0  20.0    NaN  NaN NaN   2004   wi
1222455  NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   2014  NaN
1222456  NaN   NaN     NaN  NaN   NaN    NaN  NaN NaN   2009  NaN

[1222457 rows x 19 columns]

In [3]:
df3 = df['Flag'].value_counts(dropna=False)

print(df3)

NaN    814312
i      223804
w      156134
wi      28207
Name: Flag, dtype: int64

In [4]:
814312+223804

1038116

In [5]:
156134+28207

184341

In [13]:
df3 = df.query("Flag == 'i'")

print(df3)

         ID Number                      Name  Fed Sex  Tit WTit OTit  FOA  \
10        25121731                A C J John  IND   M  NaN  NaN  NaN  NaN
11        35077023            A Chakravarthy  IND   M  NaN  NaN  NaN  NaN
12        10207538          A E M, Doshtagir  BAN   M  NaN  NaN  NaN  NaN
17        10680810  A hamed Ashraf, Abdallah  EGY   M  NaN  NaN  NaN  NaN
18         5716365           A Hamid, Harman  MAS   M  NaN  NaN  NaN  NaN
...            ...                       ...  ...  ..  ...  ...  ...  ...
1222417    4126076              Zytner, Yury  RUS   M  NaN  NaN  NaN  NaN
1222418   41801997               Zyto, Borys  POL   M  NaN  NaN  NaN  NaN
1222422   34190632            Zyubin, Sergey  RUS   M  NaN  NaN  NaN  NaN
1222428   24232602             Zyuzev, Pavel  RUS   M  NaN  NaN  NaN  NaN
1222441    1189980            Zywert, Kacper  POL   M  NaN  NaN  NaN  NaN

          SRtng  SGm    SK   RRtng  RGm    Rk   BRtng  BGm    BK  B-day Flag
10       1063.0  0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1987    i
11       1151.0  0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1986    i
12       1840.0  0.0  40.0  1836.0  0.0  20.0  1860.0  0.0  20.0   1974    i
17       1728.0  0.0  40.0     NaN  NaN   NaN  1741.0  0.0  20.0   2001    i
18       1325.0  0.0  40.0  1593.0  0.0  20.0     NaN  NaN   NaN   1970    i
...         ...  ...   ...     ...  ...   ...     ...  ...   ...    ...  ...
1222417  2261.0  0.0  20.0     NaN  NaN   NaN     NaN  NaN   NaN   1957    i
1222418  1065.0  0.0  40.0  1080.0  0.0  20.0  1061.0  0.0  20.0   2001    i
1222422  1884.0  0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1975    i
1222428  1856.0  0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1993    i
1222441  1519.0  0.0  20.0  1576.0  0.0  20.0  1607.0  0.0  20.0   1999    i

[223804 rows x 19 columns]

In [15]:
count2 = df3.groupby(['Sex', 'Fed']).size()

print(count2)

Sex  Fed
M    AFG     72
     AHO     26
     ALB    159
     ALG    431
     AND     31
           ...
     VIE    358
     WLS    203
     YEM     87
     ZAM    566
     ZIM    176
Length: 192, dtype: int64

In [16]:
count2.to_csv(r'C:\Users\crisa\Downloads\inactive_man_per_fed.csv', header=True)

In [17]:
df4 = df.query("Flag == 'wi'")

print(df4)

         ID Number                  Name  Fed Sex  Tit WTit OTit  FOA   SRtng  \
29         8605360        A La, Teng Hua  CHN   F  NaN  NaN  NaN  NaN  1915.0
60         5080444             A, Sohita  IND   F  NaN  NaN  NaN  NaN  1447.0
210       46616845       Aadharshini K J  IND   F  NaN  NaN  NaN  NaN  1289.0
519       45067970  Aadya Yatin Gaitonde  IND   F  NaN  NaN  NaN  NaN  1098.0
597       10205640       Aahelee, Sarker  BAN   F  NaN  NaN  NaN  NaN  1720.0
...            ...                   ...  ...  ..  ...  ...  ...  ...     ...
1222307   13711172         Zykova, Darya  KAZ   F  NaN  NaN  NaN  NaN  1553.0
1222308   34300503         Zykova, Julia  RUS   F  NaN  NaN  NaN  NaN  1396.0
1222314    1124102           Zyla, Agata  POL   F  NaN  NaN  NaN  NaN  1578.0
1222404    1170023         Zysko, Teresa  POL   F  NaN  NaN  NaN  NaN  1753.0
1222454   21857814   Zyznowska, Marianna  POL   F  NaN  NaN  NaN  NaN  1150.0

         SGm    SK   RRtng  RGm    Rk   BRtng  BGm    BK  B-day Flag
29       0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1993   wi
60       0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   1995   wi
210      0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   2000   wi
519      0.0  40.0  1088.0  0.0  40.0     NaN  NaN   NaN   2006   wi
597      0.0  20.0  1620.0  0.0  20.0     NaN  NaN   NaN      0   wi
...      ...   ...     ...  ...   ...     ...  ...   ...    ...  ...
1222307  0.0  20.0  1525.0  0.0  20.0  1486.0  0.0  20.0   1999   wi
1222308  0.0  40.0     NaN  NaN   NaN     NaN  NaN   NaN   2000   wi
1222314  0.0  20.0  1555.0  0.0  20.0     NaN  NaN   NaN   1996   wi
1222404  0.0  20.0     NaN  NaN   NaN     NaN  NaN   NaN   1987   wi
1222454  0.0  40.0  1072.0  0.0  20.0     NaN  NaN   NaN   2004   wi

[28207 rows x 19 columns]

In [18]:
count3 = df4.groupby(['Sex', 'Fed']).size()

print(count3)

Sex  Fed
F    AFG      1
     AHO      6
     ALB      8
     ALG     72
     AND      3
           ...
     VIE    200
     WLS     31
     YEM     10
     ZAM     41
     ZIM     48
Length: 164, dtype: int64

In [19]:
count3.to_csv(r'C:\Users\crisa\Downloads\inactive_woman_per_fed.csv', header=True)

In [14]:
df3['Sex'].value_countscounts()

M    223804
Name: Sex, dtype: int64

In [12]:
df2 = df['Sex'].value_counts()

print(df2)

M    1038116
F     184341
Name: Sex, dtype: int64

In [48]:
df1 = df.groupby('Sex').count()

print(df1)

     ID Number     Name      Fed    Tit  WTit  OTit   FOA   SRtng     SGm  \
Sex
F       184341   184341   184341   4125  4096   358   209   44913   44913
M      1038116  1038113  1038116  16421     2  1697  4299  369149  369149

         SK   RRtng     RGm      Rk   BRtng     BGm      BK    B-day    Flag
Sex
F     44029   27645   27645   27645   20183   20183   20183   184341  184341
M    367324  230721  230721  230721  160917  160917  160917  1038116  223804

In [49]:
df4 = df.groupby('Fed').count()

In [51]:
df3 = df['Sex'].value_counts(dropna=False)

print(df3)

M    1038116
F     184341
Name: Sex, dtype: int64

In [27]:
1038116+184341

1222457

In [29]:
184341/1222457*100

15.079548810305802

In [53]:
count1 = df.groupby(['Sex', 'Fed']).size()

print(count1)

Sex  Fed
F    AFG      11
     AHO      55
     ALB     105
     ALG     854
     AND      21
            ...
M    VIN      14
     WLS     618
     YEM     533
     ZAM    2314
     ZIM    1063
Length: 402, dtype: int64

In [54]:
df = pd.DataFrame(count1)

In [55]:
df.to_csv(r'C:\Users\crisa\Downloads\export_dataframe1.csv', header=True)